# St7SetBrickCavityFluid

Assigns a cavity fluid layout to a face of the specified brick.

long St7SetBrickCavityFluid(long uID, long BrickNum, long FaceNum, long CavityID)
Input Parameters
uID
Strand7 model file ID.
BrickNum
Brick number.
FaceNum
Local face number. See Brick Local Coordinates for additional information.
CavityID
Cavity fluid layout ID.

Brick Attributes – Get